1. Configure VLANs on the switches
Switch1 (Core Switch)
shell
Copy code
Switch1> enable
Switch1# configure terminal
Switch1(config)# vlan 10
Switch1(config-vlan)# name VLAN10
Switch1(config-vlan)# exit
Switch1(config)# vlan 20
Switch1(config-vlan)# name VLAN20
Switch1(config-vlan)# exit
Switch1(config)# vlan 30
Switch1(config-vlan)# name VLAN30
Switch1(config-vlan)# exit
Switch1(config)# interface range fa0/1 - 3
Switch1(config-if-range)# switchport mode trunk
Switch1(config-if-range)# exit
Switch1(config)# exit
Switch2 (Access Switch for VLAN 10)
shell
Copy code
Switch2> enable
Switch2# configure terminal
Switch2(config)# vlan 10
Switch2(config-vlan)# name VLAN10
Switch2(config-vlan)# exit
Switch2(config)# interface range fa0/1 - 2
Switch2(config-if-range)# switchport mode access
Switch2(config-if-range)# switchport access vlan 10
Switch2(config-if-range)# exit
Switch2(config)# interface fa0/3
Switch2(config-if)# switchport mode trunk
Switch2(config-if)# exit
Switch2(config)# exit
Switch3 (Access Switch for VLAN 20)
shell
Copy code
Switch3> enable
Switch3# configure terminal
Switch3(config)# vlan 20
Switch3(config-vlan)# name VLAN20
Switch3(config-vlan)# exit
Switch3(config)# interface range fa0/1 - 2
Switch3(config-if-range)# switchport mode access
Switch3(config-if-range)# switchport access vlan 20
Switch3(config-if-range)# exit
Switch3(config)# interface fa0/3
Switch3(config-if)# switchport mode trunk
Switch3(config-if)# exit
Switch3(config)# exit
Switch4 (Access Switch for VLAN 30)
shell
Copy code
Switch4> enable
Switch4# configure terminal
Switch4(config)# vlan 30
Switch4(config-vlan)# name VLAN30
Switch4(config-vlan)# exit
Switch4(config)# interface range fa0/1 - 2
Switch4(config-if-range)# switchport mode access
Switch4(config-if-range)# switchport access vlan 30
Switch4(config-if-range)# exit
Switch4(config)# interface fa0/3
Switch4(config-if)# switchport mode trunk
Switch4(config-if)# exit
Switch4(config)# exit
2. Configure Inter-VLAN Routing and DHCP on Router
Router Configuration
shell
Copy code
Router0> enable
Router0# configure terminal

# Create sub-interfaces for each VLAN
Router0(config)# interface gig0/0.10
Router0(config-subif)# encapsulation dot1Q 10
Router0(config-subif)# ip address 192.168.10.1 255.255.255.0
Router0(config-subif)# exit

Router0(config)# interface gig0/0.20
Router0(config-subif)# encapsulation dot1Q 20
Router0(config-subif)# ip address 192.168.20.1 255.255.255.0
Router0(config-subif)# exit

Router0(config)# interface gig0/0.30
Router0(config-subif)# encapsulation dot1Q 30
Router0(config-subif)# ip address 192.168.30.1 255.255.255.0
Router0(config-subif)# exit

# Configure DHCP pools for each VLAN
Router0(config)# ip dhcp pool VLAN10
Router0(dhcp-config)# network 192.168.10.0 255.255.255.0
Router0(dhcp-config)# default-router 192.168.10.1
Router0(dhcp-config)# dns-server 8.8.8.8
Router0(dhcp-config)# exit

Router0(config)# ip dhcp pool VLAN20
Router0(dhcp-config)# network 192.168.20.0 255.255.255.0
Router0(dhcp-config)# default-router 192.168.20.1
Router0(dhcp-config)# dns-server 8.8.8.8
Router0(dhcp-config)# exit

Router0(config)# ip dhcp pool VLAN30
Router0(dhcp-config)# network 192.168.30.0 255.255.255.0
Router0(dhcp-config)# default-router 192.168.30.1
Router0(dhcp-config)# dns-server 8.8.8.8
Router0(dhcp-config)# exit

Router0(config)# exit
Router0# write memory
3. Verify Configuration
On PCs
Ensure PCs in each VLAN receive IP addresses from the respective DHCP pool.

shell
Copy code
# For example, on PC in VLAN 10
PC> ipconfig /renew
On Switches
Ensure VLANs and trunk links are correctly configured.

shell
Copy code
Switch# show vlan brief
Switch# show interfaces trunk
On Router
Ensure sub-interfaces are up and correctly configured.

shell
Copy code
Router# show ip interface brief
Router# show ip dhcp binding
By following these steps, you should have a fully configured network with VLANs and DHCP.






-----------------
----------------
---------------
--------------
Enable the interfaces on the router.
Ensure that the DHCP pools are correctly configured and active.
Step-by-Step Fixes
1. Enable Router Interfaces
Your router interfaces (including the sub-interfaces) are currently down. Let's bring them up:

shell
Copy code
Router> enable
Router# configure terminal
Router(config)# interface gigabitEthernet0/0
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# interface gigabitEthernet0/0.10
Router(config-subif)# no shutdown
Router(config-subif)# exit

Router(config)# interface gigabitEthernet0/0.20
Router(config-subif)# no shutdown
Router(config-subif)# exit

Router(config)# interface gigabitEthernet0/0.30
Router(config-subif)# no shutdown
Router(config-subif)# exit

Router(config)# interface gigabitEthernet0/1
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# exit
Verify the interfaces are up:

shell
Copy code
Router# show ip interface brief
2. Check and Configure DHCP Pools
Ensure the DHCP pools are properly configured. You provided the commands, but let's double-check.

shell
Copy code
Router# configure terminal

Router(config)# ip dhcp pool VLAN10
Router(dhcp-config)# network 192.168.10.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.10.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit

Router(config)# ip dhcp pool VLAN20
Router(dhcp-config)# network 192.168.20.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.20.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit

Router(config)# ip dhcp pool VLAN30
Router(dhcp-config)# network 192.168.30.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.30.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit

Router(config)# exit
Router# write memory
3. Check VLAN and Trunk Configuration on Switches
Ensure the VLANs are correctly created and trunk ports are configured. According to your previous output, they seem correct. Here’s a recap:

Switch1 (Core Switch) has trunk links on Fa0/1, Fa0/2, Fa0/3.
Switch2, Switch3, Switch4 (Access Switches) have VLANs assigned to access ports and trunk link configured on Fa0/3.
4. Verify Configuration and Test
On Router:

shell
Copy code
Router# show ip interface brief
Router# show ip dhcp binding
Router# show running-config
On Switches:

shell
Copy code
Switch# show vlan brief
Switch# show interfaces trunk
Switch# show running-config
On PCs:
Ensure PCs in each VLAN receive IP addresses from the respective DHCP pool.

shell
Copy code
# For example, on a PC in VLAN 10
PC> ipconfig /renew


---------------
----------------
----------------
-----------------
security

1. Enable Port Security
Port Security limits the number of MAC addresses that can be learned on a switch port and can take action if a violation occurs.

Example: Enable Port Security on Access Ports (e.g., Fa0/1 to Fa0/2)

shell
Copy code
Switch> enable
Switch# configure terminal
Switch(config)# interface range fa0/1 - 2
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport port-security
Switch(config-if-range)# switchport port-security maximum 2
Switch(config-if-range)# switchport port-security violation restrict
Switch(config-if-range)# switchport port-security mac-address sticky
Switch(config-if-range)# exit
Switch(config)# exit
Explanation:

switchport port-security: Enables port security on the interface.
switchport port-security maximum 2: Limits the port to learn a maximum of 2 MAC addresses.
switchport port-security violation restrict: Specifies the action to restrict traffic if a violation occurs.
switchport port-security mac-address sticky: Allows dynamically learned MAC addresses to be added to the running configuration as static entries.
2. Disable Unused Ports
Disabling unused ports helps prevent unauthorized access.

shell
Copy code
Switch> enable
Switch# configure terminal
Switch(config)# interface range fa0/4 - 24
Switch(config-if-range)# shutdown
Switch(config-if-range)# exit
Switch(config)# exit
3. Enable BPDU Guard
BPDU Guard protects against potential STP (Spanning Tree Protocol) threats.

Example: Enable BPDU Guard on Access Ports

shell
Copy code
Switch> enable
Switch# configure terminal
Switch(config)# interface range fa0/1 - 2
Switch(config-if-range)# spanning-tree bpduguard enable
Switch(config-if-range)# exit
Switch(config)# exit
4. Enable Root Guard
Root Guard prevents designated ports from becoming the root port, protecting the STP topology.

Example: Enable Root Guard on Specific Trunk Ports

shell
Copy code
Switch> enable
Switch# configure terminal
Switch(config)# interface fa0/3
Switch(config-if)# spanning-tree guard root
Switch(config-if)# exit
Switch(config)# exit
5. Enable Storm Control
Storm Control prevents traffic storms caused by broadcast, multicast, or unicast traffic.

Example: Enable Storm Control on All Ports

shell
Copy code
Switch> enable
Switch# configure terminal
Switch(config)# interface range fa0/1 - 24, gig0/1 - 2
Switch(config-if-range)# storm-control broadcast level 1.00
Switch(config-if-range)# storm-control multicast level 1.00
Switch(config-if-range)# storm-control unicast level 1.00
Switch(config-if-range)# exit
Switch(config)# exit
Summary of Commands
Here’s a summary of the security commands for each feature:

Port Security
shell
Copy code
Switch(config)# interface range fa0/1 - 2
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport port-security
Switch(config-if-range)# switchport port-security maximum 2
Switch(config-if-range)# switchport port-security violation restrict
Switch(config-if-range)# switchport port-security mac-address sticky
Switch(config-if-range)# exit
Disable Unused Ports
shell
Copy code
Switch(config)# interface range fa0/4 - 24
Switch(config-if-range)# shutdown
Switch(config-if-range)# exit
BPDU Guard
shell
Copy code
Switch(config)# interface range fa0/1 - 2
Switch(config-if-range)# spanning-tree bpduguard enable
Switch(config-if-range)# exit
Root Guard
shell
Copy code
Switch(config)# interface fa0/3
Switch(config-if)# spanning-tree guard root
Switch(config-if)# exit
Storm Control
shell
Copy code
Switch(config)# interface range fa0/1 - 24, gig0/1 - 2
Switch(config-if-range)# storm-control broadcast level 1.00
Switch(config-if-range)# storm-control multicast level 1.00
Switch(config-if-range)# storm-control unicast level 1.00
Switch(config-if-range)# exit